In [1]:
import pandas as pd
from sqlalchemy import create_engine, text
    
engine = create_engine('mysql+pymysql://root@localhost:3306/music_development')
music = engine.connect()
data_path = '../data/'

In [5]:
sql = '''
SELECT * FROM songs
WHERE rank BETWEEN 1120 AND 1130
ORDER BY rank DESC
'''
songs = pd.read_sql(sql, music)
songs

,id,rank,name,artist_id,length,location,genre_id,youtube_code,released_date,rating,website
0,616,1124,ดอกไม้ให้คุณ (TH),321,194,หงา_คาราวาน_-_ดอกไม้ให้คุณ__TH_.mp3,3,tpyIqj06Acs,2025-12-30,0,0
1,615,1123,คืนจันทร์ (TH),332,285,เสก_โลโซ_-_คืนจันทร์__TH_.mp3,1,G2JFOEFmnnI,2025-12-30,0,0
2,614,1122,ใจสั่งมา (TH),332,259,เสก_โลโซ_-_ใจสั่งมา__TH_.mp3,1,RXZ5X_LGX9Q,2025-12-30,0,0
3,613,1121,ซมซาน (TH),332,314,เสก_โลโซ_-_ซมซาน__TH_.mp3,1,2dSGCzeuPlA,2025-12-30,0,0
4,612,1120,I Don't Want to Talk About It,80,290,Rod_Stewart_-_I_Don_t_Want_to_Talk_About_It.mp3,1,w46bWxS9IjY,2025-12-29,0,0

In [5]:
songs.dtypes

id                int64
rank              int64
name             object
artist_id         int64
length            int64
location         object
genre_id          int64
youtube_code     object
released_date    object
rating            int64
website           int64
dtype: object

In [27]:
sql = '''
SELECT * FROM songs
WHERE name LIKE "Gimme Shelter"
'''
songs = pd.read_sql(sql, engine)
songs

,id,rank,name,artist_id,length,location,genre_id,youtube_code,released_date,rating,website
0,38,38,Gimme Shelter,3,273,Gimme_Shelter.mp3,2,RbmS3tQJ7Os,1969-04-01,5,0

In [29]:
sql = '''
SELECT * FROM songs
WHERE name LIKE "Gimme Shelter"
'''
songs = pd.read_sql(sql, engine)
song = songs.iloc[0]
songId = song['id']
songId

38

In [31]:
# Method 2: Direct string printing with proper formatting
sql = f"""
SELECT id, song_id, content 
FROM lyrics 
WHERE song_id = {songId}
"""
lyric = pd.read_sql(sql, engine)
lyric

   id  song_id                                            content
0  38       38  0|♪ ♪\r\n50|Oh, a storm is threatenin'\r\n54|M...

In [33]:
lyric.dtypes

id          int64
song_id     int64
content    object
dtype: object

In [35]:
sql = text("""
SELECT artist_id, A.first_name, A.last_name, COUNT(*) AS nbr
FROM songs S 
JOIN artists A
ON S.artist_id = A.id
GROUP BY artist_id
HAVING COUNT(*) > 4
ORDER BY COUNT(*) DESC
""")
df = pd.read_sql(sql, engine)
df

    artist_id                      first_name last_name  nbr
0           1                         Beatles       The   26
1           3                  Rolling Stones       The   16
2         110                        Bee Gees             11
3         264                          Taylor     Swift   11
4          82                           Elton      John   10
5           2                             Bob     Dylan   10
6          15                           Elvis   Presley    9
7          25    Creedence Clearwater Revival              8
8          38                          Stevie    Wonder    7
9          42                              U2              6
10         10                      Beach Boys       The    6
11         31                    Led Zeppelin              6
12        120  Crosby, Stills, Nash and Young              6
13         14         Jimi Hendrix Experience       The    6
14         28                          Eagles       The    5
15         33                         Michael   Jackson    5
16         83        Sly and the Family Stone              5
17         11                             Who       The    5
18        174                          Celine      Dion    5
19          7                          Chuck      Berry    5
20          8                             Ray   Charles    5

In [23]:
sql = text("""
SELECT artist_id, A.first_name, A.last_name, S.name, S.rank, S.id
FROM songs S 
JOIN artists A
ON S.artist_id = A.id
WHERE first_name = 'CEline'
ORDER BY rank
""")
df = pd.read_sql(sql, engine)
df

   artist_id first_name last_name                  name  rank   id
0        174     Celine      Dion  Because You Loved Me   563  294
1        174     Celine      Dion   My Heart Will Go On   564  293
2        174     Celine      Dion             I'm Alive   565  292
3        174     Celine      Dion         All By Myself   566  291
4        174     Celine      Dion     The Power of Love   567  290

In [8]:
sqlUpd = text("""UPDATE lyrics SET song_id = 531 WHERE id = 450""")
print(sqlUpd)

UPDATE lyrics SET song_id = 531 WHERE id = 450

In [9]:
rp = music.execute(sqlUpd, {'song_id': songId})

# Print the number of rows affected
print("Rows updated:", rp.rowcount)

Rows updated: 1

In [13]:
sqlDel = text("""DELETE FROM lyrics WHERE id = 513""")
print(sqlDel)

DELETE FROM lyrics WHERE id = 513

In [15]:
rp = music.execute(sqlDel, {'song_id': songId})

# Print the number of rows affected
print("Rows deleted:", rp.rowcount)

Rows deleted: 1